Python 3.6.3 (v3.6.3:2c5fed8, Oct  3 2017, 17:26:49) [MSC v.1900 32 bit (Intel)] on win32
Type "copyright", "credits" or "license()" for more information.
>>> import requests
>>> import re
>>> def getHTMLText(url):
	try:
		r=requests.get(url,timeout=30)
		r.raise_for_status
		r.encoding=r.apparent_encoding
		return r.text
	except:
		return""

	
>>> def parserPage(ilt,html):
	try:
		plt=re.findall(r'\"view_price\"\:\"[\d\.]*\"',html)
		tlt=re.findall(r'\"raw_title\"\:\".*?\"',html)
		for i in range(len(plt)):
			price=eval(plt[i].split(':')[1])
			title=eval(tlt[i].split(':')[1])
			ilt.append([price,title])
	except:
		print("")

		
>>> def printGoodsList(ilt):
	tplt="{:4}\t{:8}\t{:16}"
	print(tplt.format("num","price","name"))
	count=0
	for g in ilt:
		cont=count+1
		print(tplt.format(count,g[0],g[1]))

		
>>> def main():
	goods='书包'
	depth=3
	start_url= "https://s.taobao.com/search?q=" + goods
	infoList=[]
	for i in range(depth):
		try:
			url=start_url+'&s='+str(44*i)
			html=getHTMLText(url)
			parserPage(infoList,html)
		except:
			continue
	printGoodsList(infoList)

	
>>> main()
num 	price   	name            
   0	59.00   	书包男中学生初中生高中生小学男生背包青少
   0	39.90   	迪卡侬双肩包男女学生书包健身包运动新款校园20升休闲 KIPSTA
   0	59.90   	迪卡侬旗舰店官网新款双肩背包男女户外登山包学生休闲书包QUBP
   0	220.50  	aza双肩包女包新款韩版2018百搭旅行包学生书包背包男女小清新潮
   0	69.00   	双肩包女韩版2018时尚个性百搭迷你小包包2017新款潮书包女士背包
   0	419.00  	正品瑞典北极狐/fjallraven双肩包kanken背包classic书包mini男女
   0	198.00  	小学生书包女孩1-3-4-5-6一年级三四五儿童双肩减负护脊背包女童
   0	129.00  	牛津布双肩包女韩版2017新款百搭帆布大学生尼龙书包时尚旅行背包
   0	79.00   	迪士尼小学生书包1-3-4年级男童女童6-12岁减负护脊儿童双肩背包
   0	158.00  	专柜正品JanSport杰斯伯经典双肩背包男女同款学生书包T501纯色
   0	49.00   	小学生书包6-12周岁 女儿童双肩包 3-5年级女童背包 1-3年级女孩
   0	49.00   	书包小学生 1-2-3-6年级男女生减负双肩儿童书包男孩防水护脊背包
   0	89.00   	迪士尼书包小学生男童1-3-4五年级6-12周岁女孩儿童护脊双肩背包
   0	69.00   	双肩包女韩版2017新款百搭学院风初中学生书包女大学高中校园背包
   0	139.00  	施维茨男士双肩包大容量背包女商务电脑旅行包休闲潮高中学生书包
   0	88.00   	迪士尼书包小学生女童1-3-6年级公主6-12岁女孩儿童休闲双肩背包
   0	99.00   	uek幼儿园书包男女孩宝宝公主1-3-6岁可爱卡通防走失双肩儿童背包
   0	89.00   	中学生书包男韩版高中校园小学生女初中生帆布大容量防水双肩背包
   0	129.00  	七匹狼商务双肩包男 书包中学生女双肩电脑包 旅行男士背包大容量
   0	88.00   	迪士尼书包小学生1-3-5男童四五六女双肩4-6年级儿童背包米奇书包
   0	208.00  	anello双肩包女日本代购乐天背包学生书包妈咪包alleno离家出走包
   0	129.00  	七匹狼男背包初高中校园学生大容量书包男士商务电脑旅行包双肩包
   0	79.00   	艾奔 双肩包男背包女韩版潮 商务男士电脑包高中学生书包休闲旅行
   0	208.00  	日本正品anello双肩包代购男女帆布乐天背包书包妈咪包运动潮牌
   0	179.00  	双肩包男士英伦时尚潮流韩版高中大学生书包学院风大容量旅行背包
   0	99.00   	美洲野牛双肩包男商务电脑包大容量旅行背包男学生书包女双肩包
   0	59.00   	小学生书包 6-12周岁 减负护脊双肩包3-5年级儿童书包1-3年级女孩
   0	119.00  	巴朗商务双肩包男简约时尚潮流高中大学生书包旅行电脑包男士背包
   0	28.90   	韩版夜光男士休闲旅行包背包双肩包女初中生中学生书包男时尚潮流
   0	119.00  	韩国kk树书包小学生男1-3-4-6年级儿童书包女6-12周岁双肩包护脊
   0	29.90   	书包小学生1-2-3-6年级男女生 护脊耐磨轻防水儿童双肩包6-12周岁
   0	69.00   	休闲双肩包韩版简约旅行背包电脑初中高中学生校园书包男时尚潮流
   0	59.00   	初中学生书包男时尚潮流韩版校园双肩包大容量旅行包高中男士背包
   0	79.00   	双肩包男士背包韩版潮流高中学生书包大学生女商务旅行电脑包初中
   0	139.00  	瑞士军刀双肩包男瑞士电脑旅行背包女大容量高中大学初中学生书包
   0	89.00   	书包小学生男1-3-4-6年级儿童减负护脊女6-12周岁初中学生双肩包
   0	49.00   	双肩包男时尚潮流韩版背包校园电脑包旅行包高中初中学生书包男包
   0	58.00   	新款正品旺豪减负小学生书包男女孩双肩背包防水耐磨儿童书包
   0	129.00  	七匹狼双肩包男学生书包韩版男士背包女生电脑包旅行包潮流大容量
   0	59.00   	男背包旅游休闲商务电脑韩版时尚潮流大高中学生书包旅行双肩包
   0	58.00   	美国队长书包小学生男1-3-6年级轻便耐磨儿童书包一年级双肩背包
   0	125.00  	瑞士军刀双肩包瑞士中学生书包女休闲男士商务旅行大容量电脑背包
   0	65.00   	拉杆书包小学生 1-3-6年级男生儿童书包护脊6-12周岁女孩减负防水
   0	69.00   	2018新款双肩包女牛津布韩版潮百搭背包时尚休闲书包女包包旅行包
   0	59.00   	小学生书包男童1-3-4年级双肩男孩6-12周岁轻便防水男生儿童书包
   0	149.00  	双肩包男士时尚潮流背包韩版个性书包男大学生运动休闲电脑旅行包
   0	208.00  	anello双肩包女日本乐天妈咪包书包防水背包防盗大容量离家出走包
   0	225.00  	日本anello双肩包女妈咪防盗乐天学生背包书包离家出走包alleno男
   0	225.00  	日本anello双肩包女防盗乐天背包书包妈咪包包离家出走包alleno男
   0	129.00  	卡拉羊双肩包男女大高中学生书包小学生初中韩版潮流休闲旅行背包
   0	156.00  	皓顿背包双肩包男士休闲旅行多功能大容量时尚潮流书包商务包男
   0	129.00  	七匹狼双肩包男 新款商务男士旅行背包女休闲大容量电脑学生书包
   0	158.00  	双肩包男商务防盗笔记本电脑包15.6寸书包男士大容量背包时尚潮流
   0	9.80    	厂家直销幼儿园书包批发2-7岁大中小班双肩包定做印字印logo包邮
   0	203.00  	日本anello双肩包女防盗书包乐天背包妈咪包包离家出走包alleno男
   0	69.00   	双肩包女2018新款韩版潮流百搭休闲包包学生校园书包女牛津布背包
   0	59.00   	背包男韩版双肩包时尚潮流休闲商务电脑包大容量旅行高中学生书包
   0	58.00   	轻便减负书包小学生男童1-3-4-6年级儿童书包小学生6-12岁双肩包
   0	65.00   	防盗双肩包女2018新款大容量韩版尼龙百搭书包牛津布帆布背包2017
   0	129.00  	瑞戈瑞士军刀旅行包旅游双肩包瑞士中学生书包女15.6寸电脑背包男
   0	119.00  	老人头双肩包男韩版电脑包潮流女背包休闲大容量旅行包学生书包男
   0	159.00  	双肩包男电脑包休闲防水运动背包三级包旅行包学生书包男时尚潮流
   0	49.00   	迪士尼书包小学生男女1-3-4年级米奇减负书包儿童男童男孩6-12岁
   0	69.00   	2018新款双肩包女潮流时尚休闲女包pu软皮女士背包学生校园书包小
   0	69.00   	小样幼儿园书包儿童书包1-3-5岁男女童双肩包迷你宝宝防走失背包
   0	59.00   	书包男中学生初中生高中生小学男生背包青少年校园双肩包时尚潮流
   0	128.00  	韩版小学生女儿童书包 6-12岁多功能双肩背包轻便减负1-3-4-6年级
   0	79.00   	初中学生书包女双肩包韩版潮时尚休闲日韩校园学院风高中女生背包
   0	149.00  	小米双肩包简约休闲多功能书包男女笔记本电脑包时尚潮流旅行背包
   0	129.00  	帆布格子双肩包女 韩版潮2018新款大容量休闲女包 牛津布两用背包
   0	149.00  	双肩包男电脑包防盗旅行包三级包休闲学生青年背包男书包时尚潮流
   0	108.00  	大容量商务旅行包瑞士军刀双肩包瑞士背包男士高中学生书包电脑包
   0	49.90   	森系书包女韩版原宿ulzzang 高中学生百搭简约双肩包校园学院背包
   0	59.00   	高中学生书包男士时尚潮流韩版休闲双肩包初中大学生旅行校园背包
   0	79.00   	书包女中学生初中生2018新款韩版校园百搭帆布学院风甜甜圈双肩包
   0	159.00  	卡拉羊双肩包男书包中学生初中生女小学生高中生大容量旅行背包男
   0	69.00   	牧之逸新款双肩包男休闲简约帆布包背包旅行包学生书包男时尚潮流
   0	69.90   	2018新款包包牛津布双肩包女韩版潮百搭时尚背包ulzzang学生书包
   0	59.00   	牛津布双肩包女包2018新款书包女韩版原宿ulzzang 高中学生小背包
   0	69.90   	牛津布双肩包女2018新款韩版潮原宿ulzzang学生书包帆布校园背包
>>> 
